[
  {
    "date": "timeline date",
    "title": "timeline title",
    "text": "timeline text"
  },
  {
    "date": "Aug 2, 2016",
    "title": "",
    "text": "She never slapped me nor called me names. Never forced me to have the way my first lover did after shot after shot of Ginebra chased down with 7-Up. SHe wooed me like in the movies, with poetry she wrote she wrote on her ubiquitous pad paper, her writing so deeply etched, I could read their impressions on the sheet underneath."
  },
  {
    "date": "",
    "title": "",
    "text": "She said she had never loved anyone as much as she loved me, and now I wonder if it was because she never knew how. I was her first serious relationship and I just got out of a five-year one. Before we became lovers, she had sex a few times with a clasmate who didn't ask her to be his girlfriend. Not that she would have said yes. She knew in her heart that she wanted to be with a woman, but coming was an American concept. And though she had lived in North America for mos of her life, she held on to her Filipinoness like it was a lure on a hook and she was a fish caught in foreign waters."
  },
  {
    "date": "6 years later",
    "title": "",
    "text": "The abuse started with one look-a gaze that she could never remember giving me. We were at a grocery with her mom and I had forgotten to buy something. I can't even remember what anymore. It was hot and crowded and she wanted to go home already, but it seemed I needed this something so badly that I was willing to stand back in line for it. She must have said no, that we could come back for it some other time, but I was not easily swayed."
  },
  {
    "date": "",
    "title": "",
    "text": "I was staying with her family while on a tourist visa in the US. To ehr mother whom we lived with, I would lways be the \"best friend from high school\". She convinced me to stay and helpd me get a temporary work permit. We'd been dating for a few months, having crossed that threshold from friends to lovers so giddily. We were old buddies from high school and I had always admired her feisty spirit-the same one that got her suspended for talking back to a teacher or throwing her books in class when she got written up for not wearing her school ID. She was never mean to me or our other friends. Her handsome Close-Up smile a hit with the femmes in our all-girls school. But that day at the grocery, many many years later, my former high school hearththrob was giving me a look like I was something small and crushable."
  },
  {
    "date": "",
    "title": "",
    "text": "We didn't talk when I got in the car and I held back my years until we got home. She wondered why I was so silent. When I told her why she apologized profusely, saying she dind't mean it. Later on in the relationship, the look would be accompanied by words-equally demeaning. The contexts and intensities changed but not the apologies afterwards. They were the kind that melted my resolve to go back home and were usually followed by tender lovemaking."
  },
  {
    "date": "",
    "title": "",
    "text": "In a counseling sessions years later, I talked about the look she gave me that first incident but she said it must have been my imagination. That it never happened that way. She might honestly believe this to be true but that look defined our relationship for the next four and a half years."
  },
  {
    "date": "",
    "title": "",
    "text": "Most times she was the woman I fell in love with-generous, loving and understanding. We'd go on trips together and it would be alright. They say the test of a healthy relationship is a lnog drive-the way couples interact while in the car or at rest areas, making confused stops to check the map, or not. We tried not to talk beyond exclamations of awe and delight at landmarks along the way, or the impending rain, hoping against hope that things would be perfect and contained, like the perfect assortment of food and drinks we packed in our icebox for the road trip."
  },
  {
    "date": "",
    "title": "",
    "text": "Our arguments were not about petty jealousness or shortcomings. They were about our fundamental beliefs-why the poor are poor, or why going to church is important (or not), why the Philippines is a third world country, or why I call myself lesbian. In the end I realized it wasn;t about what the point of contention was but how we argued about it. She articualted herself in English and I fumbled for the right words, translating from Tagalog in my head and then before I could reason, another repartee, louder and as eloquent as the last one. With my friends I was outspoken, confident with my words, my ENglish abundant as the red bougainvilleas in my mother's garden. But with her I was silenced, unwilling to speak my mind for fear I would make sense only to myself. \"What are you trying to say?\" \"You don't know what you're talking about.\" \"I went to the best school in America, I know more about this that you and your stupid friends...\""
  },
  {
    "date": "",
    "title": "",
    "text": "It was only when I was drunk and tipsy with liquor that I could hold my ground with her. I became fearless and alcohol was the magic stone I swallowed to become a suave superhero with not an infinitive out of place. She abused me and I abused myself. And the system that forced us to stay in the closet allowed for this to happen."
  },
  {
    "date": "",
    "title": "",
    "text": "Looking back, I know that being on a temporary visa had much to do with why I stayed in the relationship. In America, she was my family, my only link to a world where I was not afraid to talk back to an oppresive employer and no oen told me to go back where I came from. To her, who saw herself as an exile, forced to leave the motherland after high school to be with her immigrant family, I was the part of her she left behind. I took her back to that place she knew as home, where she was always young and carefree with no mortgage or credit card bills to worry about. And so we held on to eac other, perhaps too tightly at times that we didn't bother stepping back to see what was wrong."
  },
  {
    "date": "",
    "title": "",
    "text": "having been involved in the movement to end violence against women, I learned that in relationships there is always a point of no return. It could be a slap in the face, a bruising squeeze on the arm, or a swear word. To me it was that one look-a look that reminded me I was far far away from home."
  }
]